prasetia9361/ESP32-INMP441-MAX98357-ESPNOW/lib/audio/audio.cpp
#include "audio.h"
#include "soc/i2s_reg.h"
#include <esp_log.h>


static const char *TAG = "OUT";
audio::audio(i2s_port_t i2s_port, i2s_pin_config_t &i2s_pins, int size){
    m_i2s_port = i2s_port;
    m_i2s_pins = i2s_pins;
    m_raw_samples_size = size;
    m_mic_read_head = 0;
    m_frames = (int16_t *)malloc(sizeof(int16_t) * m_raw_samples_size);
    m_raw_samples = (int16_t *)malloc(sizeof(int16_t) * m_raw_samples_size);


}

audio::~audio(){
    free(m_frames);
    free(m_raw_samples);
}

void audio::startSpeaker(uint16_t sample_rate){

    for (int i = 0; i < WAVE_TABLE_SIZE; i++) {
      float t = i / (float)(WAVE_TABLE_SIZE - 1);
      float combineWave;
      float toneWave;
      float airhornWave;

      float wave = (t < 0.5f) ? (2.0f * powf(2.0f * t, N_VALUE) - 1.0f) : (1.0f - 2.0f * powf(2.0f * (t - 0.5f), M_VALUE));
      wave_table[i] = (int16_t)(wave * 32767.0f);

      if (t < 0.3f) {
        combineWave = 1 / 0.15 * (t - 0.15f);
      } else if (t >= 0.3 && t < 0.65) {
        combineWave = 2.0f * powf(2.0f * (t - 0.3f), 1) - 1.0f;
      } else {
        combineWave = 1.01f - 2.0f * powf(2.0f * (t - 1.0f), 1);
      }

      combine_table[i] = (int16_t)(combineWave * 32767.0f);

      if (t < 0.3f) {
        airhornWave = 1 / 0.15 * (t - 0.15f);
      } else if (t >= 0.3f && t < 0.45f) {
        airhornWave = -1 + 10 * (t - 0.3f);
      } else if (t >= 0.45f && t < 0.6f) {
        airhornWave = -0.5f - 6.67f * (t - 0.6f);
      } else if (t >= 0.6f && t < 0.75f) {
        airhornWave = -0.5f + 8.34f * (t - 0.6f);
      } else if (t >= 0.75f && t < 0.9f) {
        airhornWave = 0 - 5 * (t - 0.9f);
      } else if (t >= 0.9f && t < 0.95f) {
        airhornWave = 5 * (t - 0.9f);
      } else {
        airhornWave = -1 - 25 * (t - 1);
      }

      airhorn_table[i] = (int16_t)(airhornWave * 32767.0f);

      if (t < 0.1f) {
        toneWave = -0.2f + 12.0f * t;
      } else if (t < 0.2f) {
        toneWave = 1.0f - 10.0f * (t - 0.1f);
      } else if (t < 0.3f) {
        toneWave = 0.0f - 5.0f * (t - 0.2f);
      } else if (t < 0.4f) {
        toneWave = -0.5f + 5.0f * (t - 0.3f);
      } else if (t < 0.5f) {
        toneWave = 0.0f - 10.0f * (t - 0.4f);
      } else if (t < 0.6f) {
        toneWave = -1.0f + 8.0f * (t - 0.5f);
      } else if (t < 0.9f) {
        toneWave = -0.2f - 0.8f * (t - 0.6f) / 0.3f;
      } else {
        toneWave = -1.0f + 10.0f * (t - 0.9f);
      }

      tone_table[i] = (int16_t)(toneWave * 32767.0f);
    }


    i2s_config_t i2s_config = {
        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 1)
        .sample_rate = sample_rate,
#else
        .sample_rate = (int)sample_rate,
#endif
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_ONLY_RIGHT, //  I2S_CHANNEL_FMT_RIGHT_LEFT
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 2, 0)
        .communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S),
#else
        .communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S),
#endif
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = 4,
        .dma_buf_len = 128,
        .use_apll = true,
        .tx_desc_auto_clear = true,
        .fixed_mclk = 0,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 1)
        .mclk_multiple = I2S_MCLK_MULTIPLE_DEFAULT,  // Unused
        .bits_per_chan = I2S_BITS_PER_CHAN_DEFAULT   // Use bits per sample
#endif
    };
    i2s_driver_install(m_i2s_port, &i2s_config, 0, NULL);
    i2s_set_pin(m_i2s_port, &m_i2s_pins);
    i2s_zero_dma_buffer(m_i2s_port);

    i2s_start(m_i2s_port);
}

void audio::stopAudio(){
    i2s_stop(m_i2s_port);
    i2s_driver_uninstall(m_i2s_port);
}

void audio::write(int16_t *samples, int count){
    int sampleIndex = 0;
    static int16_t prev_sample = 0;
    const float alpha = 0.1; 
    while (sampleIndex < count)
    {
        int samplestoSend = 0;
        for (int i = 0; i < m_raw_samples_size && sampleIndex < count; i++)
        {
          int16_t sample = processSample(samples[sampleIndex]);
          m_frames[i] = (abs(sample) < 2048) ? 0 : sample;

          samplestoSend++;
          sampleIndex++;
        }
        size_t bytes_written = 0;
        i2s_write(m_i2s_port, m_frames, samplestoSend * sizeof(int16_t), &bytes_written, portMAX_DELAY);
        if (bytes_written != samplestoSend * sizeof(int16_t))
        {
            ESP_LOGE(TAG, "Did not write all bytes");
        }
    }
}

void audio::startBuffering(int number_samples_to_buffer){
    m_semaphore = xSemaphoreCreateBinary();
    xSemaphoreGive(m_semaphore);
    m_number_samples_to_buffer = number_samples_to_buffer;
    m_read_head = 0;
    m_write_head = 0;
    m_available_samples = 0;
    m_buffering = true;
    m_buffer_size = 3 * number_samples_to_buffer;
    m_buffer = (uint8_t *)malloc(m_buffer_size);

    memset(m_buffer, 0, m_buffer_size);
    if (!m_buffer) {
        Serial.println("Failed to allocate buffer");
    }
}

void audio::addBuffer(const uint8_t *samples, int count){
  xSemaphoreTake(m_semaphore, portMAX_DELAY);
  for (int i = 0; i < count; i++)
  {
    m_buffer[m_write_head] = samples[i];
    m_write_head = (m_write_head + 1) % m_buffer_size;
  }
  m_available_samples += count;
  xSemaphoreGive(m_semaphore);
}

void audio::removeBuffer(int16_t *samples, int count){
  xSemaphoreTake(m_semaphore, portMAX_DELAY);
  for (int i = 0; i < count; i++)
  {
    samples[i] = 0;
    if (m_available_samples == 0 && !m_buffering)
    {
      m_buffering = true;
      samples[i] = 0;
    }

    if (m_buffering && m_available_samples < m_number_samples_to_buffer){
      samples[i] = 0;
    } else
    {
      m_buffering = false;
      uint8_t sample = m_buffer[m_read_head];
      samples[i] = ((int16_t)(sample - 127)) << 10;
      m_read_head = (m_read_head + 1) % m_buffer_size;
      m_available_samples--;
    }
  }
  xSemaphoreGive(m_semaphore);
}

void audio::startMic(uint16_t sample_rate){
i2s_config_t i2s_mic_Config = {
    .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
    .sample_rate = sample_rate,
    .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
    .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT,//I2S_CHANNEL_FMT_ONLY_LEFT
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 2, 0)
    .communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S),
#else
    .communication_format = (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S),
#endif
    .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
    .dma_buf_count = 8,
    .dma_buf_len = 64,
    .use_apll = true,
    .tx_desc_auto_clear = false,
    .fixed_mclk = 0};

