prasetia9361/ESP32-INMP441-MAX98357-ESPNOW/lib/audio/audio.cpp
        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 1));

        frequency = 524 + 1142 * pola;
      }
      break;

    case 26:  // Alternate Yelp
      {
        float t = (currentMillis % 300) / 300.0f;

        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.5f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 1));

        frequency = 524 + 1142 * pola;
      }
      break;

    case 27:  // B-Wail
      {
        float t = (currentMillis % 5000) / 5000.0f;
        frequency = (t == 0) ? 790 : 790 + 766 * sin(t * PI);
      }
      break;

    case 28:  //B-Yelp
      {
        float t = (currentMillis % 600) / 600.0f;
        frequency = 1100 + 500 * sin(t * 4 * PI);
      }
      break;

    case 29:  // Dozer
      {
        float t = (currentMillis % 78) / 78.0f;

        frequency = 983.0f + 383.0f * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 30:  //Ultimate HiLo
      {
        float t = (currentMillis % 1000) / 1000.0f;
        // frekuensi high 510 low di 1150
        if (t <= 0.5) {
          frequency = 600.0f * (sin(22 * M_PI * t) > 0 ? 1 : 0);
        } else {
          frequency = 1356.0f * (sin(22 * M_PI * t) < 0 ? 1 : 0);
        }
      }
      break;

    case 31:  //Warble
      {
        float t = (currentMillis % 500) / 500.0f;
        frequency = 1075.0f * powf(2.0f * t, 0.4f);
      }
      break;

    case 32:  //Woop
      {
        float t = (currentMillis % 250) / 250.0f;
        frequency = 1075.0f * powf(2.0f * t, 0.4f);
      }
      break;

    case 33:  //Wail 378p3
      {
        float t = (currentMillis % 3500) / 3500.0f;

        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 1));

        frequency = 810 + 776 * pola;
      }
      break;

    case 34:  //Wail 850 - 1700 4s
      {
        float t = (currentMillis % 4000) / 4000.0f;

        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 1));

        frequency = 850 + 850 * pola;
      }
      break;

    case 35:  //Wail 850 - 1700 5.25s
      {
        float t = (currentMillis % 5250) / 5250.0f;

        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 1));

        frequency = 850 + 850 * pola;
      }
      break;

    case 36:  // Yelp 225
      {
        float t = (currentMillis % 225) / 225.0f;


        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 0.4f));

        frequency = 915 + 645 * pola;
      }
      break;

    case 37:  // Yelp 246
      {
        float t = (currentMillis % 246) / 246.0f;

        float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 0.4f));

        frequency = 915 + 645 * pola;
      }
      break;

    case 38:  // Wail Yelp
      {
        unsigned long cycleTime = currentMillis % 6600;

        if (cycleTime < 5000) {
          float t = cycleTime / 5000.0f;
          float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 1));

          frequency = 790 + 766 * pola;
        } else {
          float t = (cycleTime - 5000) % 400 / 400.0f;
          float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 0.4f));

          frequency = 790 + 766 * pola;
        }
      }
      break;

    case 39:  // Wail Yelp Piercer
      {
        unsigned long cycleTime = currentMillis % 7500;

        if (cycleTime < 5000) {
          float t = cycleTime / 5000.0f;
          float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 1));

          frequency = 790 + 766 * pola;
        } else if (cycleTime >= 5000 && cycleTime < 6600) {
          float t = (cycleTime - 5000) % 400 / 400.0f;
          float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 0.4f));

          frequency = 790 + 766 * pola;
        } else {
          float t = ((cycleTime - 6600) % 60) / 60.0f;
          float pola = (t < 0.5f) ? (2.0f * powf(2.0f * t, 0.4f)) : (2.0f - 2.0f * powf(2.0f * (t - 0.5f), 0.4f));

          frequency = 790 + 766 * pola;
        }
      }
      break;

    case 40:  // Mechanical Wail
      {
        float t = (currentMillis % 14000) / 14000.0f;
        frequency = 450 + 750 * sin(t * PI);
      }
      break;

    case 41:  // Italy Police
      {
        float t = (currentMillis % 800) / 800.0f;

        frequency = 830 + 320 * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 42:  // AUstria Ambulance Tone
      {
        float t = (currentMillis % 1400) / 1400.0f;

        frequency = 522.5f + 77.5f * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 43:  // Swiss Tone
      {
        float t = (currentMillis % 1300) / 1300.0f;

        frequency = 522.5f + 77.5f * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 44:  // Germany Land Tone
      {
        float t = (currentMillis % 1400) / 1400.0f;

        frequency = 442.5f + 57.5f * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 45:  //Martin Tone
      {
        unsigned long cycleTime = currentMillis % 2000;
        if (cycleTime < 1000) {
          float t = (cycleTime % 83) / 83.0f;
          frequency =   1115 + 555 * (sin(2 * M_PI * t) > 0.4 ? 1 : -1);
        } else {
          float t = (cycleTime % 83) / 83.0f;
          frequency =  800 + 400 * (sin(2 * M_PI * t) > 0.4 ? 1 : -1);
        }
      }
      break;

    case 46:  //Martin HiLo
      {
        unsigned long cycleTime = currentMillis % 1000;
        if (cycleTime < 500) {
          float t = (cycleTime % 83) / 83.0f;
          frequency = 950 + 400 * (sin(2 * M_PI * t) > 0.4 ? 1 : -1);
        } else {
          float t = (cycleTime % 83) / 83.0f;
          frequency = 800 + 400 * (sin(2 * M_PI * t) > 0.4 ? 1 : -1);
        }
      }
      break;

    case 47:  // Airhorn HiLo
      {
        float t = (currentMillis % 2000) / 2000.0f;

        frequency = 442.5f + 57.5f * (sin(2 * M_PI * t) > 0 ? -1 : 1);
      }
      break;

    case 48:  // Comp HiLo 2800 2000 List
      {
        float t = (currentMillis % 1900) / 1900.0f;
        frequency = 488.5f + 85.5f * (sin(2 * M_PI * t) > 0 ? 1 : -1);
      }
      break;

    case 49:  // Austria Police Tone
      {
        unsigned long cycleTime = currentMillis % 2300;
        if (cycleTime < 300) {
          frequency = 444;
        } else if (cycleTime >= 300 && cycleTime < 600) {
          frequency = 572;
        } else if (cycleTime >= 600 && cycleTime < 1200) {
          float t = (cycleTime - 600) / 600.0f;
          frequency = 508 + 64 * (sin(5 * M_PI * t) > 0 ? -1 : 1);
        } else if (cycleTime >= 1200 && cycleTime < 1800) {
          frequency = 572;
        } else {
          frequency = 0;
        }
      }
      break;

